In [3]:
import pandas as pd
import pyodbc
import sqlite3

# iedereen heeft andere servername btw

In [4]:
servername = 'DESKTOP-LVEKE4S\\SQLEXPRESS01'

# Northwind connectie

In [5]:
northwind_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=NorthWind; Trusted_Connection=yes')
nwCursor = northwind_conn.cursor()
nwCursor

# Adventureworks connectie

In [6]:
adventureworks_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=AdventureWorks2019; Trusted_Connection=yes')
awCursor = adventureworks_conn.cursor()
awCursor

# Aenc connectie

In [7]:
aenc_conn = pyodbc.connect('DRIVER={Microsoft Access Driver (*.mdb, *.accdb)};DBQ=../raw-databases/aenc.accdb;')
aencCursor = aenc_conn.cursor()

# Dataframes Aanmaken

### alle customer ids bijelkaar zetten

In [34]:
aenc_customerids = pd.read_sql_query('SELECT id FROM customer', aenc_conn)
nw_customerids = pd.read_sql_query('select CustomerID from Customers', northwind_conn)
aw_customerids = pd.read_sql_query('select CustomerID from Sales.Customer', adventureworks_conn)

aenc_customerids = aenc_customerids.rename(columns={'id': 'customer_id'})
nw_customerids = nw_customerids.rename(columns={'CustomerID': 'customer_id'})
aw_customerids = aw_customerids.rename(columns={'CustomerID': 'customer_id'})

aenc_en_nw = pd.concat([aenc_customerids, nw_customerids])
alle_customerids = pd.concat([aenc_en_nw, aw_customerids])
alle_customerids

C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\1718516687.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenc_customerids = pd.read_sql_query('SELECT id FROM customer', aenc_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\1718516687.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nw_customerids = pd.read_sql_query('select CustomerID from Customers', northwind_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\1718516687.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aw_customerids = pd.read_sql_query('select CustomerID from Sales.Customer', adventureworks_conn)

      customer_id
0             101
1             102
2             103
3             104
4             105
...           ...
19815       30050
19816       30072
19817       30102
19818       30104
19819       30113

[20037 rows x 1 columns]

### employee ids samenvoegen

In [36]:
aenc_employeeids = pd.read_sql_query('SELECT emp_id FROM employee', aenc_conn)
nw_employeeids = pd.read_sql_query('select EmployeeID from employees', northwind_conn)
aw_employeeids = pd.read_sql_query('select BusinessEntityID from HumanResources.Employee', adventureworks_conn)

C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\2852580526.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenc_employeeids = pd.read_sql_query('SELECT * FROM employee', aenc_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\2852580526.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nw_employeeids = pd.read_sql_query('select * from employees', northwind_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\2852580526.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aw_employeeids = pd.read_sql_query('select * from Sales.SalesPerson', adventureworks_conn)

### Northwind orders

In [57]:
nw_order = pd.read_sql_query('SELECT * FROM Orders', northwind_conn)
nw_orderdetails = pd.read_sql_query('SELECT * FROM [Order Details]', northwind_conn)
nw_order_combo = pd.merge(nw_order, nw_orderdetails, on='OrderID', how='left')
nw_order_combo_trim = nw_order_combo[['OrderID', 'Quantity', 'UnitPrice', 'ProductID', 'EmployeeID', 'CustomerID', 'OrderDate', 'ShippedDate']]
nw_order_combo_trim = nw_order_combo.rename(columns={'OrderID': 'order_id', 'Quantity': 'product_quantity', 'UnitPrice': 'product_listprice', 'EmployeeID': 'employee_employeeid', 'CustomerID': 'customer_id', 'OrderDate': 'order_date', 'ShippedDate': 'shippingdate'})
nw_order_combo_trim
# aenc_order = pd.read_sql_query('SELECT * FROM sales_order', aenc_conn)
# aw_order = pd.read_sql_query('SELECT * FROM Sales.SalesOrderHeader', adventureworks_conn)

C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\1208347784.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nw_order = pd.read_sql_query('SELECT * FROM Orders', northwind_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\1208347784.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nw_orderdetails = pd.read_sql_query('SELECT * FROM [Order Details]', northwind_conn)

,order_id,product_quantity,product_listprice,ProductID,employee_employeeid,customer_id,order_date,shippingdate
0,10248,12,14.00,11,5,VINET,1996-07-04,1996-07-16
1,10248,10,9.80,42,5,VINET,1996-07-04,1996-07-16
2,10248,5,34.80,72,5,VINET,1996-07-04,1996-07-16
3,10249,9,18.60,14,6,TOMSP,1996-07-05,1996-07-10
4,10249,40,42.40,51,6,TOMSP,1996-07-05,1996-07-10
...,...,...,...,...,...,...,...,...
2150,11077,2,33.25,64,1,RATTC,1998-05-06,NaT
2151,11077,1,17.00,66,1,RATTC,1998-05-06,NaT
2152,11077,2,15.00,73,1,RATTC,1998-05-06,NaT
2153,11077,4,7.75,75,1,RATTC,1998-05-06,NaT
2154,11077,2,13.00,77,1,RATTC,1998-05-06,NaT

# aenc orders

In [63]:
aenc_order = pd.read_sql_query('SELECT * FROM sales_order', aenc_conn)
aenc_orderdetails = pd.read_sql_query('SELECT * FROM sales_order_item', aenc_conn)
aenc_products = pd.read_sql_query('SELECT id, unit_price FROM product', aenc_conn)
aenc_order_combo = pd.merge(aenc_order, aenc_orderdetails, on='id', how='left')
aenc_order_combo = pd.merge(aenc_order_combo, aenc_products, left_on='prod_id', right_on='id', how='inner')
aenc_order_combo_trim = aenc_order_combo[['id_x', 'quantity', 'unit_price', 'prod_id', 'sales_rep', 'cust_id', 'order_date', 'ship_date']]
aenc_order_combo_trim = aenc_order_combo_trim.rename(columns={'id_x': 'order_id', 'quantity': 'product_quantity', 'unit_price': 'product_listprice', 'sales_rep': 'employee_employeeid', 'cust_id': 'customer_id', 'ship_date': 'shippingdate'})
aenc_order_combo_trim
# nw_order_combo

C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\571292206.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenc_order = pd.read_sql_query('SELECT * FROM sales_order', aenc_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\571292206.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenc_orderdetails = pd.read_sql_query('SELECT * FROM sales_order_item', aenc_conn)
C:\Users\jordi\AppData\Local\Temp\ipykernel_11200\571292206.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenc_products = pd.read_sql_query('SELECT id, unit_price FROM product', aenc_conn)

,order_id,product_quantity,product_listprice,prod_id,employee_employeeid,customer_id,order_date,shippingdate
0,2001,12,9,300,299,101,14-Mar-1996 12:00:00 AM,15-Sep-1996 12:00:00 AM
1,2001,12,14,301,299,101,14-Mar-1996 12:00:00 AM,14-Sep-1996 12:00:00 AM
2,2001,12,14,302,299,101,14-Mar-1996 12:00:00 AM,14-Sep-1996 12:00:00 AM
3,2002,24,9,400,467,102,18-Mar-1996 12:00:00 AM,18-Sep-1996 12:00:00 AM
4,2002,24,10,401,467,102,18-Mar-1996 12:00:00 AM,18-Sep-1996 12:00:00 AM
...,...,...,...,...,...,...,...,...
1098,2652,10,9,300,902,174,26-Nov-1998 12:00:00 AM,01-Dec-1998 12:00:00 AM
1099,2653,0,14,301,148,102,17-Jan-1999 12:00:00 AM,17-Oct-1999 12:00:00 AM
1100,2654,15,14,301,148,105,26-Feb-1999 12:00:00 AM,29-Oct-1999 12:00:00 AM
1101,2654,3,14,302,148,105,26-Feb-1999 12:00:00 AM,29-Oct-1999 12:00:00 AM
1102,2654,8,9,400,148,105,26-Feb-1999 12:00:00 AM,29-Oct-1999 12:00:00 AM

In [ ]:
orderdetails1 = pd.merge(nw_OrderDetails, av1 , how='outer', on=['ProductID', 'Quantity'])
orderdetails2 = pd.merge(orderdetails1, EmpxOrd, how='outer', on='OrderID')
aE_customer = aE_Customer.rename(columns={'id': 'CustomerID'}, inplace=True)
orderdetails3 = pd.concat([aE_Customer, orderdetails2], axis=0)
od = orderdetails3[['OrderID', 'Quantity', 'ListPrice', 'OrderDate', 'ShippedDate', 'ProductID', 'EmployeeID', 'CustomerID']]

od.columns

Index(['OrderID', 'Quantity', 'ListPrice', 'OrderDate', 'ShippedDate',
       'ProductID', 'EmployeeID', 'CustomerID'],
      dtype='object')

### Export

In [ ]:
od.dtypes

od['id'] = range(1, len(od) + 1)
od

C:\Users\jordi\AppData\Local\Temp\ipykernel_12876\2242498547.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  od['id'] = range(1, len(od) + 1)

,OrderID,Quantity,ListPrice,OrderDate,ShippedDate,ProductID,EmployeeID,CustomerID,id
0,NaN,NaN,NaN,NaT,NaT,NaN,NaN,101,1
1,NaN,NaN,NaN,NaT,NaT,NaN,NaN,102,2
2,NaN,NaN,NaN,NaT,NaT,NaN,NaN,103,3
3,NaN,NaN,NaN,NaT,NaT,NaN,NaN,104,4
4,NaN,NaN,NaN,NaT,NaT,NaN,NaN,105,5
...,...,...,...,...,...,...,...,...,...
3723,NaN,99.0,NaN,NaT,NaT,998.0,NaN,NaN,3850
3724,NaN,NaN,539.99,NaT,NaT,998.0,NaN,NaN,3851
3725,NaN,78.0,NaN,NaT,NaT,999.0,NaN,NaN,3852
3726,NaN,116.0,NaN,NaT,NaT,999.0,NaN,NaN,3853
3727,NaN,NaN,539.99,NaT,NaT,999.0,NaN,NaN,3854

In [ ]:
# Convert types
od['id'] = od['id'].fillna(0).astype(int)
od['OrderID'] = od['OrderID'].fillna(0).astype(int)
od['Quantity'] = od['Quantity'].fillna(0).astype(int)
od['ListPrice'] = od['ListPrice'].fillna(0).astype(float)
od['OrderDate'] = pd.to_datetime(od['OrderDate']) 
od['ShippedDate'] = pd.to_datetime(od['ShippedDate']) 
od['ProductID'] = od['ProductID'].fillna(0).astype(int)
od['EmployeeID'] = od['EmployeeID'].fillna(0).astype(int)
od['CustomerID'] = od['CustomerID'].fillna(0).astype(str)
od

NameError: name 'od' is not defined

In [ ]:
database = "UnitedOutdoors"
export_conn = pyodbc.connect("DRIVER={SQL SERVER};SERVER="+servername + ";DATABASE="+database+";Trusted_Connection=yes")
export_cursor = export_conn.cursor()
export_cursor

In [ ]:
for index, row in od.iterrows():
    try:
        query = """INSERT INTO order_details (
            order_detailsid
            order_id,
            product_quantity, 
            product_listprice,
            order_date,
            shipping_date,
            product_productid
            employee_employeeid,
            customer_id
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)"""  
        
        values = (
            row['id'],
            row['OrderID'],
            row['Quantity'],
            row['ListPrice'],
            row['OrderDate'],
            row['ShippedDate'],
            row['ProductID'],
            row['EmployeeID'],
            row['CustomerID'],

        )

        export_cursor.execute(query, values)

    except pyodbc.IntegrityError as e:
        continue
    except pyodbc.Error as e:
        print("Er is een fout opgetreden: ", e)
        print("Foutieve query: ", query)
    
export_conn.commit()

,OrderID,Quantity,ListPrice,OrderDate,ShippedDate,ProductID,EmployeeID,CustomerID,id
0,NaN,NaN,NaN,NaT,NaT,NaN,NaN,101,1
1,NaN,NaN,NaN,NaT,NaT,NaN,NaN,102,2
2,NaN,NaN,NaN,NaT,NaT,NaN,NaN,103,3
3,NaN,NaN,NaN,NaT,NaT,NaN,NaN,104,4
4,NaN,NaN,NaN,NaT,NaT,NaN,NaN,105,5
...,...,...,...,...,...,...,...,...,...
3723,NaN,99.0,NaN,NaT,NaT,998.0,NaN,NaN,3850
3724,NaN,NaN,539.99,NaT,NaT,998.0,NaN,NaN,3851
3725,NaN,78.0,NaN,NaT,NaT,999.0,NaN,NaN,3852
3726,NaN,116.0,NaN,NaT,NaT,999.0,NaN,NaN,3853
3727,NaN,NaN,539.99,NaT,NaT,999.0,NaN,NaN,3854